server/src/loadtest/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice" version="1.0">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="localhost" port="3000" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="3" unit="second">
      <users arrivalrate="10" unit="second"/>
    </arrivalphase>
    <!-- <arrivalphase phase="2" duration="10" unit="second">
      <users arrivalrate="20" unit="second" />
    </arrivalphase>
    <arrivalphase phase="3" duration="10" unit="second">
      <users arrivalrate="40" unit="second" />
    </arrivalphase>
    <arrivalphase phase="4" duration="10" unit="second">
      <users arrivalrate="80" unit="second" />
    </arrivalphase> -->
  </load>

  <options>
    <option name="glocal_ack_timeout" value="2000"/>
    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <request>
        <http url="/app/index" version="1.1" method="GET"/>
      </request>
      <!-- <thinktime value="2" random="true"></thinktime> -->

      <request>
        <http url="/app/work/19/0" version="1.1" method="GET"/>
      </request>
      <!-- <thinktime value="2" random="true"></thinktime> -->

      <request>
        <http url="/app/work/19/13" version="1.1" method="GET"/>
      </request>


    </session>
  </sessions>
</tsung>